# Pyhon's  Pandas Library

* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations

In [1]:
import numpy as np
import pandas as pd

In [3]:
# Pandas series examples
labels = ['x','y','z']
my_list = [5,15,25]
arr = np.array([5,15,25])
d = {'a':5,'b':15,'c':25}

In [4]:
pd.Series(data=my_list)

0     5
1    15
2    25
dtype: int64

In [5]:
pd.Series(data=my_list,index=labels)

x     5
y    15
z    25
dtype: int64

In [6]:
pd.Series(arr)

0     5
1    15
2    25
dtype: int64

In [7]:
pd.Series(d)

a     5
b    15
c    25
dtype: int64

# Data Frames

We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [9]:
from numpy.random import randn

In [10]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [11]:
df

          W         X         Y         Z
A  0.819555  0.758969 -1.317355 -0.112944
B -0.209893 -1.376954 -0.307769  0.983112
C -0.555525  1.658349  0.764494 -1.290001
D  0.302759 -1.231781 -0.892262  0.223520
E -0.542642 -1.125428 -0.098508  0.346064

## Selection and Indexing

grab data from a DataFrame

In [12]:
df['W']

A    0.819555
B   -0.209893
C   -0.555525
D    0.302759
E   -0.542642
Name: W, dtype: float64

In [13]:
# list of column names
df[['W','Z']]

          W         Z
A  0.819555 -0.112944
B -0.209893  0.983112
C -0.555525 -1.290001
D  0.302759  0.223520
E -0.542642  0.346064

In [28]:
#creating new column
df['new'] = df['W'] * 10

In [29]:
df[["W","new"]]

          W       new
A  0.819555  8.195546
B -0.209893 -2.098935
C -0.555525 -5.555248
D  0.302759  3.027590
E -0.542642 -5.426416

In [30]:
#dropping a column
df.drop('new',axis=1, inplace=True) # make sure indocating axis argument 1 refers to column while 0 row/index
df

          W         X         Y         Z
A  0.819555  0.758969 -1.317355 -0.112944
B -0.209893 -1.376954 -0.307769  0.983112
C -0.555525  1.658349  0.764494 -1.290001
D  0.302759 -1.231781 -0.892262  0.223520
E -0.542642 -1.125428 -0.098508  0.346064

In [31]:
#dropping a row
df.drop('E',axis=0)

          W         X         Y         Z
A  0.819555  0.758969 -1.317355 -0.112944
B -0.209893 -1.376954 -0.307769  0.983112
C -0.555525  1.658349  0.764494 -1.290001
D  0.302759 -1.231781 -0.892262  0.223520

In [35]:
#label based selection
df.loc['C']

W   -0.555525
X    1.658349
Y    0.764494
Z   -1.290001
Name: C, dtype: float64

In [33]:
#label based selection 2
df.iloc[2]

W   -0.555525
X    1.658349
Y    0.764494
Z   -1.290001
Name: C, dtype: float64

## Conditional Selection

In [37]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False  False  False   True
C  False   True   True  False
D   True  False  False   True
E  False  False  False   True

In [40]:
#seeing the True values above
df[df>0]

          W         X         Y         Z
A  0.819555  0.758969       NaN       NaN
B       NaN       NaN       NaN  0.983112
C       NaN  1.658349  0.764494       NaN
D  0.302759       NaN       NaN  0.223520
E       NaN       NaN       NaN  0.346064

In [41]:
#more spesific selection
df[df['W']>0]

          W         X         Y         Z
A  0.819555  0.758969 -1.317355 -0.112944
D  0.302759 -1.231781 -0.892262  0.223520

In [42]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.317355  0.758969
D -0.892262 -1.231781

In [50]:
df[(df['W']>0.5) & (df['Y'] < 0.5)]

          W         X         Y         Z
A  0.819555  0.758969 -1.317355 -0.112944

In [51]:
df["newColumn"] = ["val1", "val2","val3","val4","val5"]

In [53]:
df

          W         X         Y         Z newColumn
A  0.819555  0.758969 -1.317355 -0.112944      val1
B -0.209893 -1.376954 -0.307769  0.983112      val2
C -0.555525  1.658349  0.764494 -1.290001      val3
D  0.302759 -1.231781 -0.892262  0.223520      val4
E -0.542642 -1.125428 -0.098508  0.346064      val5

In [54]:
df.set_index('newColumn')

                  W         X         Y         Z
newColumn
val1       0.819555  0.758969 -1.317355 -0.112944
val2      -0.209893 -1.376954 -0.307769  0.983112
val3      -0.555525  1.658349  0.764494 -1.290001
val4       0.302759 -1.231781 -0.892262  0.223520
val5      -0.542642 -1.125428 -0.098508  0.346064

In [55]:
df.reset_index()

  index         W         X         Y         Z newColumn
0     A  0.819555  0.758969 -1.317355 -0.112944      val1
1     B -0.209893 -1.376954 -0.307769  0.983112      val2
2     C -0.555525  1.658349  0.764494 -1.290001      val3
3     D  0.302759 -1.231781 -0.892262  0.223520      val4
4     E -0.542642 -1.125428 -0.098508  0.346064      val5

# Missing Data

a few convenient methods to deal with Missing Data in pandas:

In [56]:
df = pd.DataFrame({'A':[3,4,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[6,7,8]})

In [57]:
df

     A    B  C
0  3.0  5.0  6
1  4.0  NaN  7
2  NaN  NaN  8

In [59]:
df.dropna() # drops all those rows and colums have NaN values

     A    B  C
0  3.0  5.0  6

In [60]:
df.dropna(axis=1) # drops all those and column/s has NaN values

   C
0  6
1  7
2  8

In [61]:
df.dropna(axis=0) # drops all those and row/s has NaN values

     A    B  C
0  3.0  5.0  6

In [63]:
df.dropna(thresh=2) # drops columsn and rows which have more than 2 NaN values

     A    B  C
0  3.0  5.0  6
1  4.0  NaN  7

# Filling Missing Values

In [64]:
df.fillna(value='MY VALUE')

          A         B  C
0         3         5  6
1         4  MY VALUE  7
2  MY VALUE  MY VALUE  8

In [67]:
df['B'].fillna(value=df['C'].mean())

0    5.0
1    7.0
2    7.0
Name: B, dtype: float64

# GroupBy

In [68]:
data = {'Team':['Chelsea','Chelsea','Arsenal','Arsenal','Manchester','Manchester'],
       'Player':['Christian','Oliver','Mesut','Gabriel','Paul','Daniel'],
       'Salary':[200,120,340,124,243,350]}

In [69]:
data

{'Team': ['Chelsea',
  'Chelsea',
  'Arsenal',
  'Arsenal',
  'Manchester',
  'Manchester'],
 'Player': ['Christian', 'Oliver', 'Mesut', 'Gabriel', 'Paul', 'Daniel'],
 'Salary': [200, 120, 340, 124, 243, 350]}

In [70]:
df = pd.DataFrame(data)

In [71]:
df

         Team     Player  Salary
0     Chelsea  Christian     200
1     Chelsea     Oliver     120
2     Arsenal      Mesut     340
3     Arsenal    Gabriel     124
4  Manchester       Paul     243
5  Manchester     Daniel     350

In [77]:
byTeam = df.groupby('Team')
byTeam.mean() # automaticlaly pulls numeric values and operate it

            Salary
Team
Arsenal      232.0
Chelsea      160.0
Manchester   296.5

In [84]:
byTeam = df.groupby('Player')
byTeam.mean() # automaticlaly pulls numeric values and operate it

           Salary
Player
Christian     200
Daniel        350
Gabriel       124
Mesut         340
Oliver        120
Paul          243

In [88]:
byTeam.count()

           Team  Salary
Player
Christian     1       1
Daniel        1       1
Gabriel       1       1
Mesut         1       1
Oliver        1       1
Paul          1       1

In [89]:
byTeam.describe()

          Salary
           count   mean std    min    25%    50%    75%    max
Player
Christian    1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
Daniel       1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0
Gabriel      1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0
Mesut        1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
Oliver       1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
Paul         1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0

In [91]:
byTeam.describe().transpose()

Player        Christian  Daniel  Gabriel  Mesut  Oliver   Paul
Salary count        1.0     1.0      1.0    1.0     1.0    1.0
       mean       200.0   350.0    124.0  340.0   120.0  243.0
       std          NaN     NaN      NaN    NaN     NaN    NaN
       min        200.0   350.0    124.0  340.0   120.0  243.0
       25%        200.0   350.0    124.0  340.0   120.0  243.0
       50%        200.0   350.0    124.0  340.0   120.0  243.0
       75%        200.0   350.0    124.0  340.0   120.0  243.0
       max        200.0   350.0    124.0  340.0   120.0  243.0

## Concatenating and Merging

In [93]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [94]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [95]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

**Concatenation**

In [106]:
pd.concat([df1,df2,df3]) # by default axis = 0

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [108]:
pd.concat([df1,df2,df3], axis=1) # axis = 1

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [110]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']}) 

# notice the dataframes has shared values

In [111]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

# Operations

In [121]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [122]:
df['col2'].unique() # returns unique values

array([444, 555, 666])

In [124]:
df['col2'].nunique() # len(df['col2'].unique())

3

In [125]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [126]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [127]:
newdf

   col1  col2 col3
3     4   444  xyz

# Functions

In [131]:
def times3(x):
    return x*3

In [132]:
times3(4)

12

In [135]:
#we can apply this times3 fucntion over a data frame by using apply() method
df["col1"].apply(times3)

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [136]:
df['col1'].sum()

10

In [139]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [140]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False